Sinsjr2/Arcavirt/doc/spec/RegisterSvdReference/rx64m-rtc-pilot.svd
        <register>
          <name>BCNT0CP0</name>
          <alternateRegister>RSECCP0</alternateRegister>
          <addressOffset>0x52</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BCNCP0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RMINCP0</name>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MIN1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MIN10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT1CP0</name>
          <alternateRegister>RMINCP0</alternateRegister>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BCNCP0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RHRCP0</name>
          <addressOffset>0x56</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>HR1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HR10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PM</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT2CP0</name>
          <alternateRegister>RHRCP0</alternateRegister>
          <addressOffset>0x56</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BCNCP0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDAYCP0</name>
          <addressOffset>0x5A</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATE1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATE10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT3CP0</name>
          <alternateRegister>RDAYCP0</alternateRegister>
          <addressOffset>0x5A</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BCNCP0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RMONCP0</name>
          <addressOffset>0x5C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MON1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MON10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSECCP1</name>
          <addressOffset>0x62</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SEC1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEC10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT0CP1</name>
          <alternateRegister>RSECCP1</alternateRegister>
          <addressOffset>0x62</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BCNCP1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RMINCP1</name>
          <addressOffset>0x64</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MIN1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MIN10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT1CP1</name>
          <alternateRegister>RMINCP1</alternateRegister>
          <addressOffset>0x64</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BCNCP1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RHRCP1</name>
          <addressOffset>0x66</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>HR1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HR10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PM</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT2CP1</name>
          <alternateRegister>RHRCP1</alternateRegister>
          <addressOffset>0x66</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BCNCP1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDAYCP1</name>
          <addressOffset>0x6A</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATE1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATE10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT3CP1</name>
          <alternateRegister>RDAYCP1</alternateRegister>
          <addressOffset>0x6A</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BCNCP1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RMONCP1</name>
          <addressOffset>0x6C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MON1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MON10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSECCP2</name>
          <addressOffset>0x72</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SEC1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEC10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT0CP2</name>
          <alternateRegister>RSECCP2</alternateRegister>
          <addressOffset>0x72</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BCNCP2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RMINCP2</name>
          <addressOffset>0x74</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MIN1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MIN10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT1CP2</name>
          <alternateRegister>RMINCP2</alternateRegister>
          <addressOffset>0x74</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BCNCP2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RHRCP2</name>
          <addressOffset>0x76</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>HR1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HR10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PM</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT2CP2</name>
          <alternateRegister>RHRCP2</alternateRegister>
          <addressOffset>0x76</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BCNCP2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDAYCP2</name>
          <addressOffset>0x7A</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATE1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATE10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT3CP2</name>
          <alternateRegister>RDAYCP2</alternateRegister>
          <addressOffset>0x7A</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BCNCP2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RMONCP2</name>
          <addressOffset>0x7C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MON1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MON10</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>